In [1]:
import pandas as pd 
import numpy as np

In [2]:
data=pd.read_csv('Pune house data.csv')

In [3]:
data.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,site_location
0,Super built-up Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,Alandi Road
1,Plot Area,Ready To Move,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,Ambegaon Budruk
2,Built-up Area,Ready To Move,3 BHK,NaN,1440,2.0,3.0,62.00,Anandnagar
3,Super built-up Area,Ready To Move,3 BHK,Soiewre,1521,3.0,1.0,95.00,Aundh
4,Super built-up Area,Ready To Move,2 BHK,NaN,1200,2.0,1.0,51.00,Aundh Road

In [4]:
data.shape

(13320, 9)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
14-Jul               1
16-Oct               1
16-Jul               1
Name: availability, Length: 81, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
11 BHK           2
10 BHK           2
18 Bedroom       1
14 BHK           1
12 Bedroom       1
13 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
27 BHK           1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
Maavera     1
Krberl      1
Caiseha     1
Esnamin     1
Koncyad     1
Name: society, Length: 2688, dtype: int64
********************
1200           843
1100           221
1500           205
2400           196
600            180
              ...
623              1
1189             1
4400 - 6640      1
1500Cents        1
502              1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
14.0       1
40.0       1
18.0       1
27.0       1
15.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
45.69       1
85.41       1
91.31       1
102.92      1
62.28       1
Name: price, Length: 1994, dtype: int64
********************
Dapodi             139
Parvati Darshan    139
Ghorpade Peth      139
Pashan             139
Mundhawa           139
                  ...
Warje              138
Shukrawar Peth     138
Yerawada           138
Shivaji Nagar      138
other                1
Name: site_location, Length: 97, dtype: int64
********************

In [7]:
data.isna().sum()

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [8]:
data.drop(columns=['area_type', 'availability', 'society', 'balcony'],inplace=True)

In [9]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13304 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13247 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13319 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [11]:
data['site_location'].value_counts()

Dapodi             139
Parvati Darshan    139
Ghorpade Peth      139
Pashan             139
Mundhawa           139
                  ...
Warje              138
Shukrawar Peth     138
Yerawada           138
Shivaji Nagar      138
other                1
Name: site_location, Length: 97, dtype: int64

In [12]:
data['site_location'] = data['site_location'].fillna({
    0: 'Market yard',
    1: 'Dhankawadi',
    2: 'Guruwar peth',
    3: 'Koregaon Park',
    4: 'Kothrud',
    5: 'Warje',
    6: 'Wanowrie',
    7: 'Satara Road',
    8: 'Ghorpadi'
})

In [13]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
11 BHK           2
10 BHK           2
18 Bedroom       1
14 BHK           1
12 Bedroom       1
13 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
27 BHK           1
Name: size, dtype: int64

In [14]:
data['size'] = data['size'].fillna('2 BHK')

In [15]:
data['bath'] = data['bath'].fillna(data['bath'].median())

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13320 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13320 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13319 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [17]:
data['bhk']=data['size'].str.split().str.get(0).astype(int)

In [18]:
data[data.bhk > 20]

            size total_sqft  bath  price  site_location  bhk
1718      27 BHK       8000  27.0  230.0  Uruli Devachi   27
4684  43 Bedroom       2400  40.0  660.0  Salunke Vihar   43

In [19]:
#Changed site_location (column name) to location
data = data.rename(columns={'site_location': 'location'})

In [20]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [21]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [22]:
data['total_sqft']=data['total_sqft'].apply(convertRange)

In [23]:
data.head()

        size  total_sqft  bath   price         location  bhk
0      2 BHK      1056.0   2.0   39.07      Alandi Road    2
1  4 Bedroom      2600.0   5.0  120.00  Ambegaon Budruk    4
2      3 BHK      1440.0   2.0   62.00       Anandnagar    3
3      3 BHK      1521.0   3.0   95.00            Aundh    3
4      2 BHK      1200.0   2.0   51.00       Aundh Road    2

##Price Per Square Feet

In [24]:
data['price_per_sqft'] = data['price'] *100000 / data['total_sqft']

In [25]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [26]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [27]:
data['location'].value_counts()

Dapodi             139
Parvati Darshan    139
Ghorpade Peth      139
Pashan             139
Mundhawa           139
                  ...
Warje              138
Shukrawar Peth     138
Yerawada           138
Shivaji Nagar      138
other                1
Name: location, Length: 97, dtype: int64

In [28]:
data['location'] = data['location'].apply(lambda x: x.strip() if isinstance(x, str) else x)
location_count = data['location'].value_counts()

In [29]:
location_count

Dapodi             139
Parvati Darshan    139
Ghorpade Peth      139
Pashan             139
Mundhawa           139
                  ...
Warje              138
Shukrawar Peth     138
Yerawada           138
Shivaji Nagar      138
other                1
Name: location, Length: 97, dtype: int64

In [30]:
location_count_less_10 = location_count[location_count<=10]
location_count_less_10

other    1
Name: location, dtype: int64

##Outlier detection & removal

In [31]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.802778    7.907501e+03
std     1238.405258      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [32]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [33]:
data = data[((data['total_sqft']/data['bhk']) >= 300 )]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544      2.559537    111.382401      2.650838     6303.979357
std     1261.271296      1.077938    152.077329      0.976678     4162.237981
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [34]:
data.shape

(12530, 7)

In [35]:
data.price_per_sqft.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [36]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()  
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        gen_df = subdf[(subdf.price_per_sqft > (m - st)) & (subdf.price_per_sqft <= (m + st))]
        df_output = pd.concat([df_output, gen_df], ignore_index=True)
    return df_output

data = remove_outliers_sqft(data)
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10945.000000  10945.000000  10945.000000  10945.000000    10945.000000
mean    1491.737275      2.456921     83.928549      2.565829     5381.477834
std      854.321068      0.961994     66.184050      0.895327     1606.410143
min      300.000000      1.000000     10.000000      1.000000     1379.310345
25%     1105.000000      2.000000     48.000000      2.000000     4186.046512
50%     1278.000000      2.000000     65.000000      2.000000     5108.359133
75%     1630.000000      3.000000     96.000000      3.000000     6333.333333
max    30400.000000     16.000000   2100.000000     16.000000    17548.524329

In [41]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean' : np.mean(bhk_df.price_per_sqft),
                'std' : np.std(bhk_df.price_per_sqft),
                'count' : bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [42]:
data=bhk_outlier_remover(data)

In [44]:
data.shape

(7466, 7)

In [45]:
data

            size  total_sqft  bath   price     location  bhk  price_per_sqft
0          2 BHK      1056.0   2.0   39.07  Alandi Road    2     3699.810606
1      4 Bedroom      2894.0   4.0  245.00  Alandi Road    4     8465.791292
2          2 BHK      1084.0   2.0   50.00  Alandi Road    2     4612.546125
3          2 BHK      1230.0   2.0   80.00  Alandi Road    2     6504.065041
4          3 BHK      1750.0   3.0  130.00  Alandi Road    3     7428.571429
...          ...         ...   ...     ...          ...  ...             ...
10933      4 BHK      3122.0   6.0  250.00     Yerawada    4     8007.687380
10936  6 Bedroom      3500.0   6.0  115.00     Yerawada    6     3285.714286
10939  5 Bedroom      3210.0   2.0  353.00     Yerawada    5    10996.884735
10940      2 BHK      1050.0   2.0   54.00     Yerawada    2     5142.857143
10944      2 BHK      1132.0   2.0   70.00     Yerawada    2     6183.745583

[7466 rows x 7 columns]

In [46]:
data.drop(columns=['size','price_per_sqft'],inplace=True)

##Cleande Data

In [47]:
data.head()

   total_sqft  bath   price     location  bhk
0      1056.0   2.0   39.07  Alandi Road    2
1      2894.0   4.0  245.00  Alandi Road    4
2      1084.0   2.0   50.00  Alandi Road    2
3      1230.0   2.0   80.00  Alandi Road    2
4      1750.0   3.0  130.00  Alandi Road    3

In [48]:
data.to_csv("Cleaned_data.csv")

In [49]:
X=data.drop(columns=['price'])
y=data['price']

In [50]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [51]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [52]:
print(X_train.shape)
print(X_test.shape)

(5972, 4)
(1494, 4)

##Applying Linear Regression

In [53]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']), remainder='passthrough')

In [55]:
scaler = StandardScaler()

In [56]:
lr = LinearRegression(normalize=True)

In [57]:
pipe = make_pipeline(column_trans,scaler,lr)

In [58]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [59]:
y_pred_lr = pipe.predict(X_test)

In [60]:
r2_score(y_test, y_pred_lr)

0.8875019029094351

##Applying Lasso

In [64]:
lasso = Lasso()

In [65]:
pipe = make_pipeline(column_trans,scaler, lasso)

In [66]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

##Applying Ridge

In [67]:
ridge = Ridge()

In [68]:
pipe = make_pipeline(column_trans,scaler,ridge)

In [69]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [70]:
y_pred_ridge = pipe.predict(X_test)
r2_score(y_test, y_pred_ridge)

0.8875295688276901

In [75]:
y_pred_lasso = pipe.predict(X_test)
print("No Regularization:", r2_score(y_test, y_pred))
print("Lasso:", r2_score(y_test, y_pred_lasso))
print("Ridge:", r2_score(y_test, y_pred_ridge))

No Regularization: 0.8875295688276901
Lasso: 0.8875295688276901
Ridge: 0.8875295688276901

In [76]:
import pickle

In [77]:
pickle.dump(pipe, open('RidgeModel.pkl','wb'))